---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameter.Definition
source: html/00308c2a-5024-e7d8-5e6a-90c656ea2db9.htm
---
# Autodesk.Revit.DB.FamilyParameter.Definition Property

The definition.

## Syntax (C#)
```csharp
public Definition Definition { get; }
```